youhan-liu/Dolphin-Note/RT-Thread-STM32/drivers/inc/spi_flash.h
#ifndef __SPI_FLASH_H
#define __SPI_FLASH_H

#include "stdio.h"	
//#include "sys.h" 
#include "stm32f10x.h"
#include <rtthread.h>

#define  SPI_FLASH_W25X16
//#define  SPI_FLASH_W25X32
//#define  SPI_FLASH_W25X64

#ifdef 	SPI_FLASH_W25X16
	#define SPI_FLASH_PageNum      8192
	#define SPI_FLASH_SectorNum    512
	#define SPI_FLASH_BlockNum     32
	#define sFLASH_ID              0xEF3015 //W25X16
	//#define  sFLASH_ID           0xEF4015 //W25Q16
#elif defined  SPI_FLASH_W25X32
	#define SPI_FLASH_PageNum      16384
	#define SPI_FLASH_SectorNum    1024
	#define SPI_FLASH_BlockNum     64
	#define sFLASH_ID              0xEF3016 //W25X32
	//#define  sFLASH_ID           0xEF4016 //W25Q32
#elif defined  SPI_FLASH_W25X64
	#define SPI_FLASH_PageNum      32768
	#define SPI_FLASH_SectorNum    2048
	#define SPI_FLASH_BlockNum     64
	#define sFLASH_ID              0xEF3017 //W25X64
	//#define  sFLASH_ID           0xEF4017 //W25Q64
#endif

#define SPI_FLASH_PageSize         256
#define SPI_FLASH_SectorSize 	   SPI_FLASH_PageSize*16
#define SPI_FLASH_BlockSize 	   SPI_FLASH_PageSize*256
#define SPI_FLASH_PerWritePageSize 256

#define SPI_FLASH_SPI                           SPI1
#define SPI_FLASH_SPI_CLK                       RCC_APB2Periph_SPI1
#define SPI_FLASH_SPI_SCK_PIN                   GPIO_Pin_5                  /* PA.05 */
#define SPI_FLASH_SPI_SCK_GPIO_PORT             GPIOA                       /* GPIOA */
#define SPI_FLASH_SPI_SCK_GPIO_CLK              RCC_APB2Periph_GPIOA
#define SPI_FLASH_SPI_MISO_PIN                  GPIO_Pin_6                  /* PA.06 */
#define SPI_FLASH_SPI_MISO_GPIO_PORT            GPIOA                       /* GPIOA */
#define SPI_FLASH_SPI_MISO_GPIO_CLK             RCC_APB2Periph_GPIOA
#define SPI_FLASH_SPI_MOSI_PIN                  GPIO_Pin_7                  /* PA.07 */
#define SPI_FLASH_SPI_MOSI_GPIO_PORT            GPIOA                       /* GPIOA */
#define SPI_FLASH_SPI_MOSI_GPIO_CLK             RCC_APB2Periph_GPIOA
#define SPI_FLASH_CS_PIN                        GPIO_Pin_4                  /* PC.04 */
#define SPI_FLASH_CS_GPIO_PORT                  GPIOA                       /* GPIOC */
#define SPI_FLASH_CS_GPIO_CLK                   RCC_APB2Periph_GPIOA


#define SPI_FLASH_CS_LOW()       GPIO_ResetBits(GPIOA, GPIO_Pin_4)
#define SPI_FLASH_CS_HIGH()      GPIO_SetBits(GPIOA, GPIO_Pin_4)


void SPI_FLASH_Init(void);
void SPI_FLASH_SectorErase(u32 SectorAddr);
void SPI_FLASH_BlockErase(u32 BlockAddr);
void SPI_FLASH_ChipErase(void);
void SPI_FLASH_PageWrite(u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite);
void SPI_FLASH_BufferWrite(u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite);
void SPI_FLASH_BufferRead(u8* pBuffer, u32 ReadAddr, u16 NumByteToRead);
u32 SPI_FLASH_ReadID(void);
u32 SPI_FLASH_ReadDeviceID(void);
void SPI_FLASH_StartReadSequence(u32 ReadAddr);
void SPI_Flash_PowerDown(void);
void SPI_Flash_WAKEUP(void);


u8 SPI_FLASH_ReadByte(void);
u8 SPI_FLASH_SendByte(u8 byte);
u16 SPI_FLASH_SendHalfWord(u16 HalfWord);
void SPI_FLASH_WriteEnable(void);
void SPI_FLASH_WaitForWriteEnd(void);

#endif /* __SPI_FLASH_H */

